#Student Name: Ash Hoskins, Student #S559245 Course: CSIS 44-609 - Data Analytics Fundamentals Professor Denise Case Domain: Geospatial data Module 5 Project Date: 2/09/2023

#9.3 Text-File Processing

In [14]:
#Creates a txt file and writes string data to file.
with open ('accounts.txt', mode ='w') as accounts:
    accounts.write('100 jones 24.98\n')
    accounts.write('200 Doe 345.67\n')
    accounts.write('300 white 0.00\n')
    accounts.write('400 Stone -42.16\n')
    accounts.write('500 Rich 224.62\n')

In [15]:
#Reads information from accounts.txt and displays it.
with open('accounts.txt', mode ='r') as accounts:
    print(f'{"Accounts  ":>10}{"Name":<10}{"Balance":>10}')
    for record in accounts:
        account, name, balance = record.split()
        print(f'{account:<10}{name:<10}{balance:>10}')

Accounts  Name         Balance
100       jones          24.98
200       Doe           345.67
300       white           0.00
400       Stone         -42.16
500       Rich          224.62

# 9.4 Updating Text Files

In [16]:
#With statement to update accounts.txt with a change to account 300, with the name "williams"
accounts = open('accounts.txt', 'r')
temp_file = open('temp_file.txt', 'w')

with accounts, temp_file:
    for record in accounts:
        account, name, balance = record.split()
        if account !='300':
            temp_file.write(record)
        else:
            new_record = ' '.join([account, 'Williams', balance])
            temp_file.write(new_record + '\n')

In [18]:
#Check Values of Temp_file.txt
with open('temp_file.txt', mode ='r') as accounts:
    print(f'{"Accounts  ":>10}{"Name":<10}{"Balance":>10}')
    for record in accounts:
        account, name, balance = record.split()
        print(f'{account:<10}{name:<10}{balance:>10}')

Accounts  Name         Balance
100       jones          24.98
200       Doe           345.67
300       Williams        0.00
400       Stone         -42.16
500       Rich          224.62

#9.5 Serialization with JSON

In [24]:
#Serialization of accounts.txt to accounts.json. 
#Note: Had to declare accounts dictionary prior to this code working.
import json

accounts_dict = {'accounts': [{'account': 100, 'name': 'Jones', 'balance': 24.98},
{'account': 200, 'name': 'Doe', 'balance': 345.67}]}

with open('accounts.json', 'w') as accounts:
    json.dump(accounts_dict, accounts)

In [25]:
#Deserialization the JSON Text
with open ('accounts.json', 'r') as accounts:
    accounts_json = json.load(accounts)

accounts_json

{'accounts': [{'account': 100, 'name': 'Jones', 'balance': 24.98},
  {'account': 200, 'name': 'Doe', 'balance': 345.67}]}

In [28]:
accounts_json['accounts'][1]

{'account': 200, 'name': 'Doe', 'balance': 345.67}

In [29]:
#display JSON Text
with open('accounts.json', 'r') as accounts:
    print(json.dumps(json.load(accounts), indent = 4))

{
    "accounts": [
        {
            "account": 100,
            "name": "Jones",
            "balance": 24.98
        },
        {
            "account": 200,
            "name": "Doe",
            "balance": 345.67
        }
    ]
}

#9.8 Handling Exceptions

In [30]:
#divide by zero error
divzero = 10/0
divzero

ZeroDivisionError: division by zero

In [31]:
#Wrong datatype error - String instead of int
val = int(input('Enter an integer: '))

ValueError: invalid literal for int() with base 10: 'hello'

#9.9 Finally clause

In [33]:
#Try, except, else, and finally clause tested
try: 
    print('Try suite with no exceptions raised')
except:
    print('this will not execute')
else: 
    print('else executes because no exceptions int he try suite')
finally:
    print('finally always executes')

Try suite with no exceptions raised
else executes because no exceptions int he try suite
finally always executes

#9.11 Stack unwinding and tracebacks

In [34]:
def function1():
    function2()

def function2():
    raise Exception('An exception occurred')

In [35]:
function1()

Exception: An exception occurred

#9.12 Intro to data science: Working with csv files

In [43]:
#write information to a csv file
import csv

with open('accounts.csv', mode ='w', newline='') as accounts:
    writer = csv.writer(accounts)
    writer.writerow([100, 'Jones', 24.98])
    writer.writerow([200, 'Doe', 345.67])
    writer.writerow([300, 'White', 0.00])
    writer.writerow([400, 'Stone', -42.16])
    writer.writerow([500, 'Rich', 224.62])

In [44]:
#Reading from a CSV 

with open('accounts.csv', mode ='r', newline='') as accounts:
    print(f'{"Account":<10}{"Name": <10}{"Balance": >10}')
    reader = csv.reader(accounts)
    for record in reader:
        account, name, balance = record
        print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.98
200       Doe           345.67
300       White            0.0
400       Stone         -42.16
500       Rich          224.62

In [47]:
#pandas with header information from csv file
import pandas as pd

df = pd.read_csv('accounts.csv'), 
names =['account', 'name', 'balance']

print(names)
df

['account', 'name', 'balance']

(   100  Jones   24.98
 0  200    Doe  345.67
 1  300  White    0.00
 2  400  Stone  -42.16
 3  500   Rich  224.62,)

In [56]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/' +'Rdatasets/csv/carData/TitanicSurvival.csv')

In [57]:
#Error in text had to specific display precision
pd.set_option("display.precision", 2)
titanic.head()

                        Unnamed: 0 survived     sex    age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.00            1st
1   Allison, Master. Hudson Trevor      yes    male   0.92            1st
2     Allison, Miss. Helen Loraine       no  female   2.00            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00            1st

In [58]:
titanic.tail()

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

In [59]:
titanic.describe()

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

In [60]:
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [63]:
import matplotlib as plt
histogram = titanic.hist()